src/main/java/ru/vk/itmo/test/andreycheshev/lab2/wrk2-results/perf_threads/put/t6.txt
[andrey@archlinux wrk2]$ ./wrk -d 30 -c 512 -t 6 -L -s /home/andrey/andrey/scripts/put.lua -R 17000 http://localhost:8080/v0/entity/
Running 30s test @ http://localhost:8080/v0/entity/
  6 threads and 512 connections
  Thread calibration: mean lat.: 4.864ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 5.995ms, rate sampling interval: 22ms
  Thread calibration: mean lat.: 6.497ms, rate sampling interval: 23ms
  Thread calibration: mean lat.: 4.841ms, rate sampling interval: 20ms
  Thread calibration: mean lat.: 6.240ms, rate sampling interval: 22ms
  Thread calibration: mean lat.: 4.984ms, rate sampling interval: 20ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.44ms    5.03ms  63.97ms   88.73%
    Req/Sec     2.93k     1.18k   11.59k    82.60%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.20ms
 75.000%    7.03ms
 90.000%   10.72ms
 99.000%   25.20ms
 99.900%   49.66ms
 99.990%   58.01ms
 99.999%   63.84ms
100.000%   64.00ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.093     0.000000            1         1.00
       1.234     0.100000        33363         1.11
       1.877     0.200000        66700         1.25
       2.557     0.300000       100085         1.43
       3.343     0.400000       133387         1.67
       4.199     0.500000       166754         2.00
       4.671     0.550000       183452         2.22
       5.171     0.600000       200041         2.50
       5.703     0.650000       216705         2.86
       6.315     0.700000       233412         3.33
       7.035     0.750000       250019         4.00
       7.459     0.775000       258392         4.44
       7.911     0.800000       266745         5.00
       8.423     0.825000       275080         5.71
       9.031     0.850000       283378         6.67
       9.791     0.875000       291738         8.00
      10.215     0.887500       295892         8.89
      10.719     0.900000       300063        10.00
      11.295     0.912500       304185        11.43
      12.031     0.925000       308352        13.33
      12.863     0.937500       312518        16.00
      13.335     0.943750       314626        17.78
      13.863     0.950000       316705        20.00
      14.527     0.956250       318767        22.86
      15.383     0.962500       320858        26.67
      16.351     0.968750       322933        32.00
      16.991     0.971875       323977        35.56
      17.615     0.975000       325026        40.00
      18.319     0.978125       326072        45.71
      19.391     0.981250       327102        53.33
      20.847     0.984375       328143        64.00
      21.871     0.985938       328659        71.11
      22.927     0.987500       329180        80.00
      24.415     0.989062       329701        91.43
      25.711     0.990625       330222       106.67
      28.031     0.992188       330744       128.00
      28.943     0.992969       331005       142.22
      30.047     0.993750       331264       160.00
      31.743     0.994531       331524       182.86
      33.055     0.995313       331788       213.33
      34.431     0.996094       332046       256.00
      35.871     0.996484       332176       284.44
      38.303     0.996875       332305       320.00
      39.327     0.997266       332437       365.71
      40.319     0.997656       332567       426.67
      41.183     0.998047       332697       512.00
      41.823     0.998242       332764       568.89
      42.527     0.998437       332827       640.00
      44.319     0.998633       332892       731.43
      46.687     0.998828       332958       853.33
      50.975     0.999023       333021      1024.00
      53.087     0.999121       333055      1137.78
      55.039     0.999219       333086      1280.00
      55.935     0.999316       333120      1462.86
      56.223     0.999414       333155      1706.67
      56.447     0.999512       333188      2048.00
      56.575     0.999561       333204      2275.56
      56.671     0.999609       333216      2560.00
      56.799     0.999658       333238      2925.71
      56.895     0.999707       333253      3413.33
      57.023     0.999756       333266      4096.00
      57.215     0.999780       333274      4551.11
      57.375     0.999805       333284      5120.00
      57.503     0.999829       333291      5851.43
      57.631     0.999854       333298      6826.67
      57.823     0.999878       333307      8192.00
      57.887     0.999890       333310      9102.22
      58.111     0.999902       333315     10240.00
      58.239     0.999915       333318     11702.86
      58.399     0.999927       333322     13653.33
      58.463     0.999939       333326     16384.00
      58.495     0.999945       333328     18204.44
      58.559     0.999951       333330     20480.00
      58.847     0.999957       333332     23405.71
      59.199     0.999963       333334     27306.67
      60.735     0.999969       333336     32768.00
      61.791     0.999973       333337     36408.89
      61.951     0.999976       333338     40960.00
      62.303     0.999979       333339     46811.43
      62.463     0.999982       333340     54613.33
      63.135     0.999985       333341     65536.00
      63.167     0.999986       333342     72817.78
      63.167     0.999988       333342     81920.00
      63.839     0.999989       333344     93622.86
      63.839     0.999991       333344    109226.67
      63.839     0.999992       333344    131072.00
      63.839     0.999993       333344    145635.56
      63.839     0.999994       333344    163840.00
      63.903     0.999995       333345    187245.71
      63.903     0.999995       333345    218453.33
      63.903     0.999996       333345    262144.00
      63.903     0.999997       333345    291271.11
      63.903     0.999997       333345    327680.00
      63.999     0.999997       333346    374491.43
      63.999     1.000000       333346          inf
#[Mean    =        5.439, StdDeviation   =        5.028]
#[Max     =       63.968, Total count    =       333346]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  499896 requests in 30.02s, 31.94MB read
Requests/sec:  16651.02
Transfer/sec:      1.06MB